---
kind: method
id: M:Autodesk.Revit.DB.Mullion.BreakMullion
source: html/c5deddca-d472-a0e9-0e94-9e865382aa9e.htm
---
# Autodesk.Revit.DB.Mullion.BreakMullion Method

This method is used to break the current Mullion at ends with its neighboring mullions.

## Syntax (C#)
```csharp
public void BreakMullion()
```

## Remarks
The mullions being perpendicular to it will be joined accordingly.